{
  "architectures": [
    "BertForMaskedLM"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier": "linear",
  "cls_hidden_scale": 2,
  "code_voc": 512,
  "finetuning_task": "vqa_text",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.05,
  "hidden_size": 768,
  "img_feature_dim": 2054,
  "img_feature_type": "faster_r-cnn",
  "img_layer_norm_eps": 1e-12,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_bert": true,
  "layer_norm_eps": 1e-12,
  "loss_type": "bce",
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_contrast_classes": 3,
  "num_hidden_layers": 12,
  "num_labels": 3129,
  "output_attentions": false,
  "output_hidden_states": false,
  "pad_token_id": 0,
  "torchscript": false,
  "type_vocab_size": 2,
  "use_img_layernorm": 1,
  "use_layernorm": true,
  "vocab_size": 30522
}
